Page({

  /**
   * 页面的初始数据
   */
  data: {
    xuanId: '0',
    gif: '0',
    iconArray: [{
        "iconUrl": 'https://blackboy.club/xiaoyuan/quwei/gushi.png',
        "iconText": '睡前故事',
        "Ztie": [{
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "我暗恋一妹子，想找机会表白，今天她一闺蜜跟我透露说这个妹子很向往找一个暖男做男友，细想一下我的为人处事，备感自信，我认真问她闺蜜：“你看我算不算暖男？” 她说“暖男还是要看脸的，你顶多算个热狗！"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "各位刚生孩子的父母，千万不要把小孩的后脑勺睡平，不然以后孩子长大了脱发，如果要留光头，平的不好看"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "拿着一根牛毛就说自己有一头牛，那叫吹牛；有一头牛展示一头牛，那叫坦然；有九头牛，把每一头都拉出来溜一遍，那叫炫耀；有九头牛只露一毛，那叫低调；有养牛场却假装不认识牛毛，那叫城府!吹牛让人同情，坦然让人亲近，炫耀让人反感，低调让人诚服，城府给人距离！我要做个低调的人，所以，我绝对不会告诉你们我家有矿！！！"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "我羡慕两种女人：一种是特别拽，走路带风，自己干事业贼牛，谁都不屌的那种。一种是娇滴滴会撒娇，任谁看见都想拼了老命保护的。刚好，我是卡在中间了，既不牛还不会撒娇，一天到晚还死犟死犟！"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "小时候妈妈给我定过娃娃亲，是个超帅的小哥哥，只是没过几年他们家就搬走了，他当时特别宠我每天都把好吃的零食给我吃，还带我去看他打球，我现在很想他，可是我联系不上他了。麻烦笑友们帮我找找，我真的很想跟他再续前缘，虽然过了这么多年，但我依稀记得他好像叫什么彭于晏。"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "闺蜜小声问我：“你是不是看上刚才给你看病的那个医生了？”我惊讶的看着闺蜜说道：“你怎么看出来的！”闺蜜淡定的说道：“来的时候，你一直吵吵胃疼！他给你检查的时候，你却说你胸口疼。”我。。。"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "给暗恋的女神发消息：“我下个月就要死了，你能来参加我的葬礼吗？”她回复：“下个月没空，这个月有空，你能早点死吗？”"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "A：“结婚后，不论下班多晚，我都会先回爸妈家待一会再回自己家，毕竟，我明白一个道理。”B：“陪伴是最好的孝顺？”A：“喝我爹的酒不花钱。。。"
          },
          {
            "Title": "开心一刻",
            "Time": "2018-9-21",
            "Text": "从来不上夜班的我，竟然被安排今晚值夜班了，我问领导：“为嘛把我安排到夜班了？”领导：“高层领导明个来检查，白班要留几个颜值高点的！”"
          }
        ]
      },
      {
        "iconUrl": 'https://blackboy.club/xiaoyuan/quwei/gaoxiao.png',
        "iconText": '校园笑话',
        "Ztie": [{
            "Title": "校园笑段,快要开学啦!",
            "Time": "2018-6-07",
            "Text": "我本来不相信人有前生，直到遇到了你，我开始笃定上辈子一定做了缺德的事情。"
          },
          {
            "Title": "嘚瑟的学生,特别是小明",
            "Time": "2018-6-07",
            "Text": "老师找小明谈话：为什么上课老睡觉？小明说：下课太吵了根本睡不着。"
          },
          {
            "Title": "校园笑段,都不怎么喜欢学习",
            "Time": "2018-6-07",
            "Text": "学霸以成绩为动力，学渣以作业为动力，我就厉害了，以上课睡觉为动力！"
          },
          {
            "Title": "校园笑段和小明滚出去",
            "Time": "2018-6-07",
            "Text": "外甥读幼儿园时，我经常抱着他到处去玩，现在他三年级了不让我抱，我问他为什么？他说：“我现在已经有审美观了。”我。。。"
          },
          {
            "Title": "同学爆笑,笑了好几回",
            "Time": "2018-6-07",
            "Text": "室友是个古香古色的人，早睡早起，不吃垃圾食品，玩游戏，看手机都特有节制，尤其看书，只看纸制的。我好奇：电子书不是更方便吗？他：纸质的，手感好，有墨香味，翻上几页，有助睡眠！"
          },
          {
            "Title": "校园的几段小幽默",
            "Time": "2018-6-07",
            "Text": "这次儿子考了个倒数第一，老婆问怎么回事？儿子：“考第一没那本事，落个中等无人问津，还不如考个倒数第一秀一把存在感。”"
          },
          {
            "Title": "师生之间带刺的幽默",
            "Time": "2018-6-07",
            "Text": "我们老师特别会讽刺人，很讨厌他，有一次看我的作业对我道：都说字如其人，好歹你也是我们学校的校草，你这字怎么跟狗刨的一样？"
          },
          {
            "Title": "校园逗段笑死人",
            "Time": "2018-6-07",
            "Text": "校长说：校服上除了校徽别别别的，让你们别别别的别别别的你非得别别的！"
          }
        ]
      },
      {
        "iconUrl": 'https://blackboy.club/xiaoyuan/quwei/haowan.png',
        "iconText": '玩物区',
        "Ztie": [{
            "Title": "贪玩蓝月",
            "Time": "2018-6-07",
            "Text": "贪玩蓝月，老兄弟，新传奇！"
          },
          {
            "Title": "变态传奇",
            "Time": "2018-6-07",
            "Text": "经典变态版，祖玛套装遍地爆，幸运+9没问"
          },
          {
            "Title": "传奇世界",
            "Time": "2018-6-07",
            "Text": "宏大的背景,精美地图,特色系统,三大职业风云"
          },
          {
            "Title": "电掣星驰",
            "Time": "2018-6-07",
            "Text": "PK畅快淋漓，闪现，施法，技能全新升级！"
          },
          {
            "Title": "贪玩传世",
            "Time": "2018-6-07",
            "Text": "上古神话，史上最强神器“苍穹”降临人间！"
          },
          {
            "Title": "雷霆之怒",
            "Time": "2018-6-07",
            "Text": "画面精美，装备靠打，史上最爽pk！"
          },
          {
            "Title": "小志传奇",
            "Time": "2018-6-07",
            "Text": "网页传奇进服赚元宝，装备特好搞！"
          },
          {
            "Title": "迷失传说",
            "Time": "2018-6-07",
            "Text": "单职业PK开局一白虎，变态单职业"
          }
        ]
      },
      {
        "iconUrl": 'https://blackboy.club/xiaoyuan/quwei/quwei.png',
        "iconText": '趣味区',
        "Ztie": [{
          "Title": "成语接龙",
            "Time": "2018-6-07",
          "Text": "根据指定的字说一个成语，第一个成语的尾字为第二个成语的首字，一直接下去，哪个组用最少的词接回第一个成语的首字为胜。"
          },
          {
            "Title": "双人顶气球接力",
            "Time": "2018-6-07",
            "Text": "两人一组只能用脸部贴着气球从一头跑到另一头，中途气球掉下重来，先完成的一组取胜。"
          },
          {
            "Title": "瞎子穿拖鞋转载于社团网ishetuan",
            "Time": "2018-6-07",
            "Text": "概要:蒙眼前进5步或6步穿拖鞋的游戏方法:1、各队轮流派出1人。2、把拖鞋放在起点前方5步的地方。3、回到起点蒙眼旋转三次以后出发。4、能够准确前进5步，第6步穿到拖鞋教多的一组获胜。参考：进行中对方可以用错误的指示来扰乱。"
          },
          {
            "Title": "官兵捉贼 ",
            "Time": "2018-6-07",
            "Text": "用具：分别写着“官、兵、捉、贼”字样的四张小纸人数：4个人方法：将四张纸折叠起来，参加游戏的四个人分别抽出一张，抽到“捉”字的人要根据其他三个人的面部表情或其他细节来猜出谁拿的是“贼”字，猜错的要罚，有猜到“官”字的人决定如何惩罚，由抽到“兵”字的人执行。兴奋点：简单易行，不受时间地点场合的限制"
          },
          {
            "Title": "正话反说",
            "Time": "2018-6-07",
            "Text": "1、每队各出一人参加游戏。2、主持人要事先准备好一些词语。说一个词语，参与者要反着说一遍，比如“新年好”，游戏者要立刻说出“好年新”，说错或者猛住的人即被淘汰。从三个字开始说起，第二轮四个字，第三轮五个字，以此类推，估计到五个字以上的时候游戏者就所剩无几了。3、最后胜出的四个队获奖。"
          },
          {
            "Title": "终极密码",
            "Time": "2018-6-07",
            "Text": "1.先选一个人当裁判，从1-100中挑选一个数字ex:数字是162.第一个人说56就代表接下来范围在1 - 56之间3.接下来重复第2个步骤EX: 第二个人说36就代表接下来范围在1 - 36之间，然后重复~4.喊道指定号码的就要接受惩罚~"
          },
          {
            "Title": "心有灵犀yesorno",
            "Time": "2018-6-07",
            "Text": "两个嘉宾面对面，每个的头上放一个牌子，牌子上的字是嘉宾要猜得人或事物，彼此先告诉对方一个大概范围。每人可以问对方问题，用一般疑问句来确定答案，我只回答YES/NO,直到最后才出具体是什么。"
          },
          {
            "Title": "歌曲接龙",
            "Time": "2018-6-07",
            "Text": "可以分组PK,主持人制定主题,如\"花\",则每组必须唱含有花字歌词的歌曲.那队接不上,就为输.也可以个人之间的PK, 主持人先告诉观众一个主题, 如\"花\", 但是玫瑰是不能唱的, 观众知道, 但是不要说出来, 然后每个人上去唱歌, 如有人不小心唱到\"玫瑰\", 那就要接受惩罚.接不上的也要惩罚."
          }
        ]
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    wx.setNavigationBarTitle({
      title: '校园趣味',
    })
    var that = this;
    var gif = this.data.gif
    setTimeout(function() {
      that.setData({
        gif: '1'
      })
    }, 2500)
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  quuwei: function(res) {
    var xuanId = this.data.xuanId;
    this.setData({
      xuanId: res.currentTarget.dataset.id
    })
  },

  /**
   * 生命周期函数--监听页面显示
   */
  qw: function() {
     wx.navigateTo({
       url: '../../pages/qwtie/qwtie',
     })
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})